{"posts":[{"title":"Dynamic Programming","text":"Dynamic Programming","link":"/2025/09/14/Dynamic-Programming/"},{"title":"My New Post","text":"","link":"/2025/09/12/My-New-Post/"},{"title":"Home Page","text":"","link":"/2025/09/07/hello-world/"}],"tags":[{"name":"Software Engineering","slug":"Software-Engineering","link":"/tags/Software-Engineering/"}],"categories":[{"name":"Tutorials","slug":"Tutorials","link":"/categories/Tutorials/"}],"pages":[{"title":"Murad Qasaimeh","text":"Welcome! This is the home page. You can edit source/index.md to add your intro, links, or a summary of your work.","link":"/index.html"},{"title":"Projects","text":"List of projects: Structured Pruning for Deep Neural Networks (DNNs): Implemented magnitude-based structured weight pruning method to improve the performance of its hardware implementation, by keeping number of NNZ values per channel fixed to help load balancing. (Python, Tensorflow). CUDA Implementation of Sparse DNNs: Implemented a high-performance CUDA implementation of structurly sparse DNN and compared its performance with NVIDIA libraries for dense and sparse DNNs: (cuDNN, cuBLAS and cuSPARSE). (C++, CUDA). Benchmarking Vision Kernels and Neural Network Inference Accelerators on Embedded Platforms [1]: Conducted comprehensive benchmarks of accuracy, run-time, and energy efficiency of a wide range of vision kernels and neural networks on multiple embedded platforms: ARM57 CPU, Nvidia Jetson TX2 GPU and Xilinx ZCU102 FPGA. (xFOpenCV, OpenCV, VisionWorks)","link":"/Projects/index.html"},{"title":"Categories","text":"","link":"/categories/index.html"},{"title":"Curriculum","text":"CareerMTS Software Engineer, AMD (Full‑time) Location: San Jose, California, United States Dates: Aug 2022 – Present Highlights: Enabling development of compilers, simulators, and performance analysis tools for AI/ML engines. Developing an end‑to‑end compiler for ML frameworks targeting AMD AIE devices using LLVM and MLIR. Lead Software Engineer, Cadence Design Systems (Full‑time) Location: San Jose, California, United States Dates: Sep 2020 – Jul 2022 (1 yr 11 mos) Research Assistant, Iowa State University Location: Ames, Iowa Dates: Sep 2015 – Jun 2020 (4 yrs 10 mos) Research Engineer Intern, Xilinx Location: San Jose, California Dates: May 2018 – Nov 2018 (7 mos) Education Iowa State University – Ames, Iowa PhD in Electrical and Computer Engineering, GPA: 3.85 (2015 – 2020) Thesis: Efficient Processing of Computer Vision and Deep Learning on FPGAs American University of Sharjah – Sharjah, UAE Master in Electrical and Computer Engineering, GPA: 3.82 (2012 – 2014) Thesis: An FPGA-based Parallel Hardware Architecture for Real-time Image Classification Jordan University of Science and Technology – Irbid, Jordan Bachelor of Science in Computer Engineering, GPA: 85.7/100 (2006 – 2012) Senior Design Project: Indoor Mobile Robot Localization and Navigation SkillsProgramming LanguageI often program using C/C++, CUDA, CMake, and Python. I also have experience in C#, Java at least one large project with each. Machine Learning and Deep Learning Natural Language Processing Computer Vision Speech Processing Statistical Methods Optimization Methods","link":"/Curriculum/index.html"},{"title":"Tutorials","text":"Quick links to tutorial categories: AI Compilers: /categories/AI-Compilers/ LeetCode: /categories/LeetCode/ Hardware Architecture: /categories/Hardware-Architecture/","link":"/tutorials/index.html"},{"title":"PUBLICATIONS","text":"Publications","link":"/Publications/index.html"}]}